# Напишите программу, которая выведет на экран:

print('"Khal Drogo\'s favorite word is "athjahakar""')