# Напишите программу, которая выводит на экран:

# - Did Joffrey agree?
# - He did. He also said "I love using \n".

print('- Did Joffrey agree?\n- He did. He also said "I love using \\n".')