'''Создайте переменную, описывающую количество своих братьев, и присвойте ей значение 2. Распечатайте содержимое переменной. Затем сравните свое имя с именем, которое используется в учительском решении.'''

my_brothers_count = 2

print(my_brothers_count)