'''Найдите в программе необъявленную переменную и объявите ее, присвоив ей значение 'Dragon'.

После выполнения программы результат на экране должен выглядеть так:

Targaryen
 and
Dragon'''

family = 'Targaryen'

# BEGIN
pet = 'Dragon'
# END

print(family)
print(' and ')
print(pet)