'''Выведите на экран строку Do you want to eat, <name>?. Где вместо <name> должна использоваться переменная stark. Вывод должен получиться таким:'''

stark = 'Arya'

# BEGIN
print(f'Do you want to eat, {stark}?')
# END