'''Выведите на экран последний символ строки, находящейся в переменной name'''

name = 'Na\nharis'

# BEGIN
print(name[7])
# END