'''Выведите на экран друг за другом три имени: Robert, Stannis, Renly. В результате на экране должно отобразиться:'''

print('Robert')
print('Stannis')
print('Renly')