'''Выведите на экран число -0.304.'''

print(-0.304)