'''Теперь ваша очередь посмотреть на сигнатуру функции в документации и разобраться, как её использовать.

В Python есть функция hex(). Изучите её сигнатуру на странице документации.

Напишите программу, которая использует функцию hex() с переменной number и выводит результат на экран.'''

number = 255

# BEGIN
print(hex(number))
# END