'''Функция type() позволяет определить тип передаваемого аргумента. Название типа возвращается в виде строки. Например, вызов type(10) вернёт строку <class 'int'> (int, это сокращение от integer — целое число).

print(type('wow')) # <class 'str'>
Выведите на экран тип значения переменной motto.'''

motto = 'Family, Duty, Honor'

# BEGIN
print(type(motto))
# END