'''Это задание не связано с уроком напрямую. Но будет полезным потренироваться с выводом на экран.

Выведите на экран:'''

print('What Is Dead May Never Die')