'''Выведите на экран результат деления числа 81 на 9.'''

print(81 / 9)