'''Реализуйте программу, которая вычисляет и выводит на экран значение выражения:'''

print(((8 / 2) + 5) - (-3 / 2))